app/Controllers/Actividad.php

    public function guardar()
    {
        $actividadModel = new ActividadModel();

        // 1️⃣ Validación del formulario
        if (!$this->validate([
            'nombre' => 'required|min_length[3]',
            'descripcion' => 'required|min_length[5]',
            'precio' => 'required|decimal',
            'imagen' => 'uploaded[imagen]|is_image[imagen]|max_size[imagen,2048]'
        ])) {
            return redirect()->back()->with('error', 'Error en el formulario')->withInput();
        }

        // 2️⃣ Subida de la imagen
        $imagen = $this->request->getFile('imagen');
        if ($imagen->isValid() && !$imagen->hasMoved()) {
            $nuevoNombre = $imagen->getRandomName();
            $imagen->move(FCPATH . 'uploads/actividades', $nuevoNombre);
        } else {
            return redirect()->back()->with('error', 'Error al subir la imagen');
        }

        // 3️⃣ Procesar las fechas
        $fechas = $this->request->getPost('fechas'); // ej: "2025-10-20,2025-10-21"
        $fechasArray = array_map('trim', explode(',', $fechas));
        $cantidadFechas = count($fechasArray);

        // 4️⃣ Guardar en la DB
        $actividadModel->save([
            'nombre'             => $this->request->getPost('nombre'),
            'precio'             => $this->request->getPost('precio'),
            'descripcion'        => $this->request->getPost('descripcion'),
            'disponibilidad'     => $cantidadFechas,
            'imagen'             => $nuevoNombre,
            'fechas_disponibles' => json_encode($fechasArray)
        ]);
---
INSERT INTO `actividad` (`nombre`, `precio`, `descripcion`, `disponibilidad`, `imagen`, `fechas_disponibles`) VALUES ('Avistaje de aves', '12000', 'Observar el vuelo de aves es una opción de ecoturismo para disfrutar de la naturaleza en pleno Buenos Aires.\r\n', 3, '1760721884_45832640a3d341810aad.jpg', '[\"2025-10-17\",\"2025-10-24\",\"2025-10-31\"]')