app/Controllers/ActividadController.php

SELECT *
FROM `actividad`
---
    public function index()
    {
        $actividadModel = new ActividadModel();
        $data['actividades'] = $actividadModel->findAll();