app/Models/usuariomodel.php

INSERT INTO `usuario` (`nombre`, `apellido`, `gmail`, `clave`, `id_rol`) VALUES ('celina', 'maldonado', 'celimaldonado@gmail.com', '$2y$10$RhM1pwSEFn0DNFfRywAuG.9wsFr0fi.si8.eMd6UWTGnaFjtUqBrG', 2)
---
    public function insertarDatos(array $datos): bool {
        // insert() devuelve el ID insertado o false si falla
        return $this->insert($datos) !== false;